eabre/STM32f401VE-Turnstile-system/Baran_Yusuf_Tanriverdi_Odev_2/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */
void LED_Toggle(void); // Timer interruptinda kullanilacak fonksiyon tanimlamasi

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LCD_D4_Pin GPIO_PIN_8
#define LCD_D4_GPIO_Port GPIOD
#define LCD_D5_Pin GPIO_PIN_9
#define LCD_D5_GPIO_Port GPIOD
#define LCD_D6_Pin GPIO_PIN_10
#define LCD_D6_GPIO_Port GPIOD
#define LCD_D7_Pin GPIO_PIN_11
#define LCD_D7_GPIO_Port GPIOD
#define Start_Button_Pin GPIO_PIN_12
#define Start_Button_GPIO_Port GPIOD
#define Start_Button_EXTI_IRQn EXTI15_10_IRQn
#define Pause_Button_Pin GPIO_PIN_13
#define Pause_Button_GPIO_Port GPIOD
#define Pause_Button_EXTI_IRQn EXTI15_10_IRQn
#define Stop_Button_Pin GPIO_PIN_14
#define Stop_Button_GPIO_Port GPIOD
#define Stop_Button_EXTI_IRQn EXTI15_10_IRQn
#define Rand_Sig_Pin GPIO_PIN_1
#define Rand_Sig_GPIO_Port GPIOD
#define Sensor_Reader_Pin GPIO_PIN_2
#define Sensor_Reader_GPIO_Port GPIOD
#define Start_LED_Pin GPIO_PIN_3
#define Start_LED_GPIO_Port GPIOD
#define Pause_LED_Pin GPIO_PIN_4
#define Pause_LED_GPIO_Port GPIOD
#define Stop_LED_Pin GPIO_PIN_5
#define Stop_LED_GPIO_Port GPIOD
#define LCD_RES_Pin GPIO_PIN_6
#define LCD_RES_GPIO_Port GPIOD
#define LCD_EN_Pin GPIO_PIN_7
#define LCD_EN_GPIO_Port GPIOD
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
